---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Events.PreDocEventArgs
source: html/7f9a8b1f-8d8d-fa8d-948e-35be3e7cc5a4.htm
---
# PreDocEventArgs Members

Indicates whether the event is being cancelled.
When the event is cancellable, set the property to True to cancel it.